app/controllers/authors_controller.rb

INSERT INTO "authors" ("age", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["age", 25], ["created_at", Thu, 04 Jul 2013 09:48:31 UTC +00:00], ["name", "Amruthesh"], ["updated_at", Thu, 04 Jul 2013 09:48:31 UTC +00:00]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save