app/controllers/books_controller.rb

  def index
    if params[:author_id]
      @books = Book.includes(:author).of(params[:author_id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" IN (1)
SELECT "books".* FROM "books" WHERE (author_id = '2')

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("created_at", "price", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Thu, 04 Jul 2013 10:20:19 UTC +00:00], ["price", 100.5], ["updated_at", Thu, 04 Jul 2013 10:20:19 UTC +00:00]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "details" = $1, "updated_at" = $2 WHERE "books"."id" = 2  [["details", {"title"=>"Ruby Programming Language", "description"=>"This is a book on the Ruby Programming language"}], ["updated_at", Thu, 04 Jul 2013 10:29:41 UTC +00:00]]

    def set_book
      @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE (details -> 'title' like '%Par%') ORDER BY id asc